### Import the libraries

In [3]:
import pandas as pd
import numpy as np

### 1. Create the below data frame

In [5]:
df = pd.DataFrame({
'ord_no':[70001,np.nan,70002,70004,np.nan,70005,np.nan,70010,70003,70012,np.nan,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['2012-10-05','2012-09-10',np.nan,'2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3002,3001,3001,3003,3002,3001,3001,3004,3003,3002,3001,3001],
'salesman_id':[5002,5003,5001,np.nan,5002,5001,5001,np.nan,5003,5002,5003,np.nan]})
df

     ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001.0     150.50  2012-10-05         3002       5002.0
1       NaN     270.65  2012-09-10         3001       5003.0
2   70002.0      65.26         NaN         3001       5001.0
3   70004.0     110.50  2012-08-17         3003          NaN
4       NaN     948.50  2012-09-10         3002       5002.0
5   70005.0    2400.60  2012-07-27         3001       5001.0
6       NaN    5760.00  2012-09-10         3001       5001.0
7   70010.0    1983.43  2012-10-10         3004          NaN
8   70003.0    2480.40  2012-10-10         3003       5003.0
9   70012.0     250.45  2012-06-27         3002       5002.0
10      NaN      75.29  2012-08-17         3001       5003.0
11  70013.0    3045.60  2012-04-25         3001          NaN

### 2. Find the program to show missing values only

In [9]:
df.isnull()

    ord_no  purch_amt  ord_date  customer_id  salesman_id
0    False      False     False        False        False
1     True      False     False        False        False
2    False      False      True        False        False
3    False      False     False        False         True
4     True      False     False        False        False
5    False      False     False        False        False
6     True      False     False        False        False
7    False      False     False        False         True
8    False      False     False        False        False
9    False      False     False        False        False
10    True      False     False        False        False
11   False      False     False        False         True

### 3.Count the number of missing values in each column of a given DataFrame.

In [75]:
df.isnull().sum()

ord_no         0
purch_amt      0
ord_date       1
customer_id    0
salesman_id    3
dtype: int64

### 4.  Drop the rows where at least one element is missing

In [73]:
df.dropna()

    ord_no  purch_amt    ord_date  customer_id  salesman_id
0  70001.0     150.50  2012-10-05         3002       5002.0
5  70005.0    2400.60  2012-07-27         3001       5001.0
8  70003.0    2480.40  2012-10-10         3003       5003.0
9  70012.0     250.45  2012-06-27         3002       5002.0

### 5. Drop the columns where at least one element is missing

In [77]:
df.dropna(axis = 1)

     ord_no  purch_amt  customer_id
0   70001.0     150.50         3002
2   70002.0      65.26         3001
3   70004.0     110.50         3003
5   70005.0    2400.60         3001
7   70010.0    1983.43         3004
8   70003.0    2480.40         3003
9   70012.0     250.45         3002
11  70013.0    3045.60         3001

### 6.  Drop the rows where all the element is missing

In [79]:
df.dropna(how = 'all')

     ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001.0     150.50  2012-10-05         3002       5002.0
2   70002.0      65.26         NaN         3001       5001.0
3   70004.0     110.50  2012-08-17         3003          NaN
5   70005.0    2400.60  2012-07-27         3001       5001.0
7   70010.0    1983.43  2012-10-10         3004          NaN
8   70003.0    2480.40  2012-10-10         3003       5003.0
9   70012.0     250.45  2012-06-27         3002       5002.0
11  70013.0    3045.60  2012-04-25         3001          NaN

### 7. Drop the rows where two elements are missing

In [81]:
df.dropna(thresh = 2)

     ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001.0     150.50  2012-10-05         3002       5002.0
2   70002.0      65.26         NaN         3001       5001.0
3   70004.0     110.50  2012-08-17         3003          NaN
5   70005.0    2400.60  2012-07-27         3001       5001.0
7   70010.0    1983.43  2012-10-10         3004          NaN
8   70003.0    2480.40  2012-10-10         3003       5003.0
9   70012.0     250.45  2012-06-27         3002       5002.0
11  70013.0    3045.60  2012-04-25         3001          NaN

### 8.Drop those rows in which ord_no and customer_id have missing values.

In [89]:
df.dropna(subset = ['ord_no', 'customer_id'], inplace = True)
df

     ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001.0     150.50  2012-10-05         3002       5002.0
2   70002.0      65.26         NaN         3001       5001.0
3   70004.0     110.50  2012-08-17         3003          NaN
5   70005.0    2400.60  2012-07-27         3001       5001.0
7   70010.0    1983.43  2012-10-10         3004          NaN
8   70003.0    2480.40  2012-10-10         3003       5003.0
9   70012.0     250.45  2012-06-27         3002       5002.0
11  70013.0    3045.60  2012-04-25         3001          NaN

 ### 9.Calculate the total number of missing values

In [91]:
#Method 1
df.isna().sum().sum()

4

In [95]:
#Method 2
df.isna().sum().values.sum()

4

### 10. Replace NaNs with in ord_no with  0

In [9]:
df.fillna(0)['ord_no']

0     70001.0
1         0.0
2     70002.0
3     70004.0
4         0.0
5     70005.0
6         0.0
7     70010.0
8     70003.0
9     70012.0
10        0.0
11    70013.0
Name: ord_no, dtype: float64

### 11. Replace NaNs in salesman_id with the values from previous row or the next row

In [15]:
df.fillna(method = 'bfill')['salesman_id']

C:\Users\User\AppData\Local\Temp\ipykernel_14424\1481745496.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = 'bfill')['salesman_id']

0     5002.0
1     5003.0
2     5001.0
3     5002.0
4     5002.0
5     5001.0
6     5001.0
7     5003.0
8     5003.0
9     5002.0
10    5003.0
11       NaN
Name: salesman_id, dtype: float64

### 12. Replace NaNs with median or mean in purch_amt

In [31]:
mean_value = df['purch_amt'].mean()
df['purch_amt'].fillna(mean_value)

0      150.50
1      270.65
2       65.26
3      110.50
4      948.50
5     2400.60
6     5760.00
7     1983.43
8     2480.40
9      250.45
10      75.29
11    3045.60
Name: purch_amt, dtype: float64

In [33]:
df

     ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001.0     150.50  2012-10-05         3002       5002.0
1       NaN     270.65  2012-09-10         3001       5003.0
2   70002.0      65.26         NaN         3001       5001.0
3   70004.0     110.50  2012-08-17         3003          NaN
4       NaN     948.50  2012-09-10         3002       5002.0
5   70005.0    2400.60  2012-07-27         3001       5001.0
6       NaN    5760.00  2012-09-10         3001       5001.0
7   70010.0    1983.43  2012-10-10         3004          NaN
8   70003.0    2480.40  2012-10-10         3003       5003.0
9   70012.0     250.45  2012-06-27         3002       5002.0
10      NaN      75.29  2012-08-17         3001       5003.0
11  70013.0    3045.60  2012-04-25         3001          NaN

In [35]:
median_value = df['purch_amt'].median()
df['purch_amt'].fillna(median_value)

0      150.50
1      270.65
2       65.26
3      110.50
4      948.50
5     2400.60
6     5760.00
7     1983.43
8     2480.40
9      250.45
10      75.29
11    3045.60
Name: purch_amt, dtype: float64

In [37]:
df

     ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001.0     150.50  2012-10-05         3002       5002.0
1       NaN     270.65  2012-09-10         3001       5003.0
2   70002.0      65.26         NaN         3001       5001.0
3   70004.0     110.50  2012-08-17         3003          NaN
4       NaN     948.50  2012-09-10         3002       5002.0
5   70005.0    2400.60  2012-07-27         3001       5001.0
6       NaN    5760.00  2012-09-10         3001       5001.0
7   70010.0    1983.43  2012-10-10         3004          NaN
8   70003.0    2480.40  2012-10-10         3003       5003.0
9   70012.0     250.45  2012-06-27         3002       5002.0
10      NaN      75.29  2012-08-17         3001       5003.0
11  70013.0    3045.60  2012-04-25         3001          NaN